# Файловете във вашата home директория съдържат информация за музикални албуми и
# имат специфична структура. Началото на всеки ред е годината на издаване на албума, а непосредствено,
# след началото на всеки ред следва името на изпълителя на песента. Имената на файловете се
# състоят от една дума, която съвпада с името на изпълнителя

# Да се напише shell скрипт приемащ два параметъра, които са имена на файлове от вашата home директория.
# Скриптът сравнява, кой от двата файла има повече на брой редове, съдържащи неговото
# име(на файла). За файлът победител изпълнете следните действия:
# • извлечете съдържанието му, без годината на издаване на албума и без името на изпълнителя
# • сортирайте лексикографски извлеченото съдържание и го запишете във файл с име ’изпълнител.songs’

#!/bin/bash

if [[ $# -ne 2 ]]; then
    echo "Two args needed"
    exit 1
fi

if [[ ! -f "$1" || ! -f "$2" ]]; then
  echo "Only valid files required"
  exit 2
fi

fsize=$(wc -l "$1")
ssize=$(wc -l "$2")

winner=""

if [[ $fsize -gt $ssize ]]; then
    winner=$1
else
    winner=$2
fi

filename="${winner}.songs"

while read line; do
  echo "$line" >> "$filename"
done < <(cat "$winner" | sed -E "s/^[^\-]+-//g" | sort)
