# В текущата директория има само обикновени файлове (без директории). Да се напише
# bash script, който приема 2 позиционни параметъра– числа, който мести файловете от текущата ди
# ректория към нови директории (a, b и c, които трябва да бъдат създадени), като определен файл се
# мести към директория ’a’, само ако той има по-малко редове от първи позиционен параметър, мести
# към директория ’b’, ако редове са между първи и втори позиционен параметър и в ’c’ в останалите случаи

#!/bin/bash

if [[ $# -ne 3 ]]; then
    echo "Exatcly 3 numbers are required"
    exit 1
fi

mkdir -p ./a ./b ./c

while read file; do

done < <()
