# Напишете скрипт, който приема три задължителни позицонни аргумента:
# • име на файл
# • низ1
# • низ2
# Файлът е текстови, и съдържа редове във формат:
# ключ=стойност
# където стойност може да бъде:
# • празен низ, т.е. редът е ключ=
# • низ, състоящ се от един илиповече термове, разделени с интервали, т.е., редът е ключ=𝑡1 𝑡2 𝑡3
# Скриптът трябва да променя реда с ключ низ2 така, че обединението на термовете на редовете с ключове
# низ1 и низ2 да включва всеки терм еднократно

#!/bin/bash

if [[ $# -ne 3 ]]; then
    echo "Exactly three arguments required"
    exit 1
fi

FILE="$1"
STR1="$2"
STR2="$3"

if [[ ! -f "$FILE" ]]; then
    echo "File doesn't exist"
fi

LINE1="$(grep "$STR1")"
LINE2="$(grep "$STR2")"

if [[ -z "$LINE1" || -z "$LINE2" ]]; then
    echo "Strings not found in the file"
    exit 1
fi

ARGS1=$(cut -d '=' -f 2 < <(echo "$LINE1"))
ARGS2=$(cut -d '=' -f 2 <<< "$LINE2")

UNION=$(echo "$ARGS1 $ARGS2" | sed -e "s/ /\n/g" | sort | uniq -c | awk)# ...
