# Напишете скрипт, който приема три задължителни позицонни аргумента:
# • име на файл
# • низ1
# • низ2
# Файлът е текстови, и съдържа редове във формат:
# ключ=стойност
# където стойност може да бъде:
# • празен низ, т.е. редът е ключ=
# • низ, състоящ се от един илиповече термове, разделени с интервали, т.е., редът е ключ=𝑡1 𝑡2 𝑡3
# Скриптът трябва да променя реда с ключ низ2 така, че обединението на термовете на редовете с ключове
# низ1 и низ2 да включва всеки терм еднократно

#!/bin/bash

if [[ $# -ne 3 ]] ; then
    echo "Expected 3 arguments"
    exit 1
fi

args1=$(cat "${1}" | egrep  "^${2}=" | awk -F '=' '{print $2}' | tr ' ' '\n')
args2=$(cat "${1}" | egrep  "^${3}=" | awk -F '=' '{print $2}' | tr ' ' '\n')

while read line ; do
    echo "${args1}" | grep -q -F "${line}"
    if [[ ${?} -ne 0 ]] ; then
                result+=$(echo "${line} ")
        fi
done < <(echo "${args2}")

sed -i -E "s/(${3}=).*/\1${result}/g" ${1}
