# Напишете шел скрипт, който приема множество параметри. Общ вид на извикване:
# ./foo.sh [-n N] FILE1...
# В общияслучай параметрите се третират като имена на (.log) файлове, които трябва да бъдат обработени
# от скрипта, със следното изключение: ако първият параметър е стрингът-n, то вторият параметър е число,
# дефиниращо стойност на променливата N, която ще ползваме в скрипта. 
# Лог файловете са текстови, като всеки ред има следния формат:
# • време: timestamp във формат YYYY-MM-DD HH:MM:SS
# • интервал
# • данни: поредица от символи с произволна дължина
# За удобство приемаме, че редовете във всеки файл са сортирани по време възходящо
# (виж цялото условие в pdf-а)

#!/bin/bash

if [[ $# -eq 0 ]]; then
    echo "Atleast one param must be passed"
    exit 1
fi

N=10 # default value

if [[ "$1" == "-n" ]]; then
    if [[ "$2" =~ "^(0|[1-9][0-9]*)$" ]]
fi
