# Да се напише shell скрипт, който валидира дали дадено цяло число попада в целочислен интервал.
# Скриптът приема 3 аргумента: числото, което трябва да се провери; лява граница на интервала; дясна граница на интервала.
# Скриптът да връща exit status:
# - 4, когато броят на аргументите е различен от 3
# - 3, когато поне един от трите аргумента не е цяло число
# - 2, когато границите на интервала са обърнати
# - 1, когато числото не попада в интервала
# - 0, когато числото попада в интервала

#!/bin/bash

if [[ $# -ne 3 ]]; then
    exit 4
fi

for num in $@; do
    if [[ ! "$num" =~ "[0-9]+" ]]; then
        exit 3
    fi
done

if [[ $2 -gt $3 ]]; then
    exit 2
fi

if [[ $1 -lt $2 && $1 -gt $3 ]]; then
    exit 1
fi

exit 0
