# (Цветно принтиране) Напишете shell script color_print, който взима два параметъра.
#
# Първият може да е измежду "-r", "-g" "-b", а вторият е произволен string.
# На командата "echo" може да се подаде код на цвят, който ще оцвети текста в определения цвят.
# В зависимост от първия аргумент, изпринтете втория аргумен в определения цвят:

# "-r" е червено. Кодът на червеното е '\033[0;31m' (echo -e "\033[0;31m This is red")
# "-g" е зелено. Кодът на зеленото е '\033[0;32m' (echo -e "\033[0;32m This is green")
# "-b" е синьо. Кодът на синьото е '\033[0;34m' (echo -e "\033[0;34m This is blue")
# Ако е подадена друга буква изпишете "Unknown colour",
# а ако изобщо не е подаден аргумент за цвят, просто изпишете текста.

#!/bin/bash

if [[ $# -lt 1 || $# -gt 2 ]]; then
    echo "Only one or more arguments required"
    exit 1
fi

if [[ $# -gt 1 ]]; then
    case "$1" in
        "-r")
            echo -e "\033[0;31m $2";;
        "-g")
            echo -e "\033[0;32m $2";;
        "-b")
            echo -e "\033[0;34m $2";;
        *)
            echo "Unknown colour";;
    esac
else
    echo "$1"
fi

echo -e "\033[0m"
