# Напишете серия от команди,които намират всички обикновени файлове, отговарящи едновременно на следните условия:
# • намиратсевhomeдиректорията натекущияпотребител, но не и в нейните под-директории;
# • собственик им етекущият потребител.
# Серията от команди трябва да променя правата на намерените файлове така, че да станат такива,
# каквито биха се получили, ако при създаването на файловете ефективната маска е била 0002

 find ./ -maxdepth 1 -type f -user $(id -un) &>/dev/null | xargs -r -I{} chmod 664 {}
