USE PC

-- Напишете заявка, която извежда модел, честота и размер на диска за всички персонални компютри с цена под 1200 долара. Задайте псевдоними за атрибутите честота и размер на диска, съответно MHz и GB
SELECT model, speed AS MHz, hd AS GB FROM Computer WHERE price < 1200.00

-- Напишете заявка, която извежда производителите на принтери без повторения
SELECT DISTINCT maker FROM Product WHERE type='Printer'

-- Напишете заявка, която извежда модел, размер на паметта, размер на екран за лаптопите, чиято цена е над 1000 долара
SELECT model, ram, screen FROM Laptop WHERE price > 1000

-- Напишете заявка, която извежда всички цветни принтери
SELECT * FROM Printer WHERE color='y'

-- Напишете заявка, която извежда модел, честота и размер на диска за тези персонални компютри със CD 12x или 16x и цена под 2000 долара
SELECT model, speed, hd FROM PC WHERE (cd='12x' OR cd='16x') AND price < 2000
