# Копирайте всички файлове от /etc, които могат да се четат от всички, в директория myetc в home директорията ви. Направете такава, ако нямате.

# може да надвиши лимита на Shell - добър вариант за малко на брой файлове
mkdir ~/myetc && cp $(find /etc -type f -perm /444 2>/dev/null) ~/myetc 

# или

# по-доброто от двете, безопасно използване на cp
mkdir ~/myetc && find /etc -type f -perm /444 2>/dev/null -exec cp -- {} ~/myetc \;
# {} - самите аргументи(в нашия случай, пътеки), -- - използва се за файлове като "-config", Shell може да го обърка с flag
