# Копирайте <РЕПО>/exercises/data/emp.data във вашата home директория.
cp /srv/fmi-os/exercises/data/emp .

# Посредством awk, използвайки копирания файл за входнни данни, изведете:

# - общия брой редове
awk "END{ print NR }" emp

# - третия ред
awk "NR==3 { print }" emp

# - последното поле от всеки ред
awk "{ print $NF }" emp

# - последното поле на последния ред
awk "END{ print $NF }" emp

# - всеки ред, който има повече от 4 полета
awk "{if(NF > 4) { print }}" emp

# - всеки ред, чието последно поле е по-голямо от 4
awk "{if(NF > 4) { print }}" emp

# - общия брой полета във всички редове
awk "BEGIN{ i=0 } { i+=NF } END{ print i }" emp

# - броя редове, в които се среща низът Beth
awk "BEGIN{ i=0 } /.*Beth.*/ { i+=1 } END{ print i }" emp

# - най-голямото трето поле и редът, който го съдържа
awk 'BEGIN{ max = 0; line = " " } {if ($3 > max) {max = $3; line = $0}} END{ printf line" "max"\n" }' emp

# - всеки ред, който има поне едно поле
awk "{ if(NF > 0) print }" emp

# - всеки ред, който има повече от 17 знака
awk "/.{18,}$/ { print $0 }" emp

# - броя на полетата във всеки ред и самият ред
awk '{ print NF" "$0 }' emp

# - първите две полета от всеки ред, с разменени места
awk '{ print "cols=" NF "\n" "line=" $0 }' emp

# - всеки ред така, че първите две полета да са с разменени места
awk '{ print $2" "$1" "$3 }' emp

# - всеки ред така, че на мястото на първото поле да има номер на реда
awk '{ print NR" "$2" "$3 }' emp

# - всеки ред без второто поле
awk '{ print $1" "$3 }' emp

# - за всеки ред, сумата от второ и трето поле
awk '{ print $2 + $3 }' emp

# - сумата на второ и трето поле от всеки ред
awk 'BEGIN {sum = 0} {sum += $2 + $3} END {print sum}' emp
