# Даден ви е ASCII текстов файл - /etc/services. Отпечатайте хистограма на 10-те най-често срещани думи.
# Дума наричаме непразна последователност от букви. Не правим разлика между главни и малки букви.
# Хистограма наричаме поредица от редове, всеки от които има вида:
# <брой срещания> <какво се среща толкова пъти>

sed 's/[^a-zA-Z]/ /g' /etc/services | sed 's/ /&\n/g' | sort | uniq -i -c | sort -nr | awk  '{ if(NF>1) print }' | head
# close attemp, small bug with uniq

# или

grep -o '[a-zA-Z]*' | tr [A-Z] [a-z] | sort | uniq -c | sort -nr | head
